rules.org
#+title:      My Pen And Paper RPG Ruleset
#+date:       [2022-10-03 Mo 13:19]

#+OPTIONS: toc:nil H:10 tex:t author:nil date:nil num:3
#+LaTeX_HEADER: \usepackage[a4paper, total={7in, 11in}]{geometry}
#+LaTeX_HEADER: \pagenumbering{gobble}
#+LATEX_HEADER: \usepackage{multicol}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \setlength{\itemsep}{0.mm}
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setlist[itemize]{noitemsep}
#+LATEX_HEADER: \usepackage[table]{xcolor}

#+LATEX: {\rowcolors{1}{grey!20}{grey!10}

#+HTML_HEAD: <style type="text/css">
#+HTML_HEAD:   	body {
#+HTML_HEAD:		background-color: #ACF;
#+HTML_HEAD:		font-family: "Roboto","Arial",sans-serif;
#+HTML_HEAD:		margin-left: 20vw;
#+HTML_HEAD:		margin-right: 20vw;
#+HTML_HEAD:	}
#+HTML_HEAD:	tbody tr:nth-child(odd) {
#+HTML_HEAD:		background-color: ##9BF;
#+HTML_HEAD:	}
#+HTML_HEAD:	tbody tr:nth-child(even) {
#+HTML_HEAD:		background-color: #8AF;
#+HTML_HEAD:	}
#+HTML_HEAD:	tbody th {
#+HTML_HEAD:		background-color: #8AF;
#+HTML_HEAD:	}
#+HTML_HEAD:	thead th {
#+HTML_HEAD:		background-color: #8AF;
#+HTML_HEAD:	}
#+HTML_HEAD:	table {
#+HTML_HEAD:		background-color: #ACF;
#+HTML_HEAD:		border: 1px solid #000;
#+HTML_HEAD:		margin: 20px;
#+HTML_HEAD:        float: right;
#+HTML_HEAD:	}
#+HTML_HEAD:    .decorationright {
#+HTML_HEAD:		position: fixed;
#+HTML_HEAD:		right: 0;
#+HTML_HEAD:		top: 0;
#+HTML_HEAD:		height: 100%;
#+HTML_HEAD:		width: 20vw;
#+HTML_HEAD:		background-image: linear-gradient(to right, rgba(4,96,205,0), rgba(4,96,205,1));
#+HTML_HEAD:	}
#+HTML_HEAD:	.decorationleft {
#+HTML_HEAD:		position: fixed;
#+HTML_HEAD:		left: 0;
#+HTML_HEAD:		top: 0;
#+HTML_HEAD:		height: 100%;
#+HTML_HEAD:		width: 20vw;
#+HTML_HEAD:		background-image: linear-gradient(to right, rgba(4,96,205,1), rgba(4,96,205,0));
#+HTML_HEAD:	}
#+HTML_HEAD: </style>


* COMMENT TODOs
- Charakter rechner
- Geld anders darstellen?

* Rules

#+LATEX: \begin{multicols}{2}[]
** Character Values
*** Attributes
Attributes dedscribe a characters potential. The higher the value the greater things a character can achieve. There are the following 8 Attributes beloning to the 4 categories.

| *Category* | *Attribute* | *Description*             |
|------------+-------------+---------------------------|
| Physical   | Strength    | strength and hardyness    |
|            | Dexterity   | agility, speed, precision |
|------------+-------------+---------------------------|
| Mental     | Will        | percevirance, attention   |
|            | Intelect    | intellegence, knowledge   |
|------------+-------------+---------------------------|
| Sozial     | Empathy     | understanding people      |
|            | Charisma    | interacting with people   |
|------------+-------------+---------------------------|
| Resources  | Gear        | Gear you have prepared    |
|            | Finances    | Money and investments     |

#+ATTR_LATEX: :align c|l
| *Level* | *Grade*     |
|---------+-------------|
|       3 | Unskilled   |
|       5 | Beginner    |
|       7 | Experienced |
|       9 | Master      |
|      11 | Grandmaster |
|      13 | Legend      |

They determine the amount of dice you can use for [[#sec:checks][checks]]. 

*** Skill
The skill determines the likelyhood of a success on a roll. A roll during a [[#sec:checks][checks]] is counted as a success if the dice shows less or equal eyes than the skill.

Skills measure the mastery of a skill. They are expressed as a background description and a level (number between 1 and 6). The skill levels are comparable to how much time a typical person has to spend to reach the same expertise in this area if it were his dayjob. This does however not mean that a character needs to have taken that time to reach his skill level. Level 1 for any skill is free. Not all skills cost the same, the price depends on how specific it is.

#+ATTR_LATEX: :align c|l
| *Level* | *Equivalent experience* |
|-------+-----------------------|
|     1 | 0 years               |
|     2 | 2 years               |
|     3 | 5 years               |
|     4 | 10 years              |
|     5 | 15 years              |
|     6 | 20 years              |

See chapter [[#sec:loskills][List of Skills]] for examples.

*Merge Skills*
It might happen that you have a lot of very specific skills. If that is the case you can combine them to a more general skill. The total CP cost has to stay the same.

*** Traits
Traits are distinglishing things about the character. They can be bought for character points. This is possible both at character creation and later in the game.
 They might be extraordinary strength or the ability to cast certain magic. Some traits (like all magic) should come with a risk (all checks are risky checks). 

#+begin_quote
Herkulian Stength (7CP):
You are extra strong. For feats of strength you can roll 1 additional die and get at least one success.
#+end_quote

#+begin_quote
Pyromancy (7CP):
You can make a risky mental check to summon the primordial elemental forces of fire. You can shape and direct them to cause effects. 
#+end_quote

*** Character Creation
Distribute 110 CP on your Attributes, Skills and Traits

Use the Rules under Equipment to limit your starting gear.

Character Advancement:
You may reward your players with CP (character points) for reaching milestones in the story or simply surviving the session.

- A skill point typicaly costs 7 CP but can vary based on how specific they are.
- An attribute point costs 2 CP.
- A Trait typically costs 7 CP but can vary widely. Negative traits can even have a negative price.

** Checks and Contests
:PROPERTIES:
:CUSTOM_ID: sec:checks
:END:

Roll as many six sided dice as your attribute value is. Count each die with your skill level or less eyes and subtract the difficulty (default is 0) of the check. The result are your successes. If the successes are negative the check fails.

- Parties describe what they indent to do
- Parties decide (secretly) how many dice they want to use for each action
- Everybody rolles their dice
- Results of the checks are described. 

*Effects:*
- Every action has a default effect. For example in a fight it is wounding an enemy.
- Different effects can also be declared by the player. (e.g. disarming the enemy).
- Combinations are also possible
- An Effect might cost more than one success.

*Colaborative checks:*
Everyone rolls individually and then sum together all successes.

*Contest:*
Both parties each roll their check. the party with the higher successes wins and can use the difference in successes to declare effects. By default the effect is to damage the enemy.

*Risky checks:*
If a check is risky the character might incurr something bad if the check fails. If the check fails the difference between the negative successes are used to incur effects to the characters disadvantage. 

*Multible actions:*
You can perform multible actions. The checks are made independently. You can use at most the higher of the atributes numbers of dice in total. For each action your maximum number of dice is your respective attribute value. An common example is to use some of the action to attack and some to defend.

*Predefined Effekts:*
You can learn to achieve a certain combination of effects very effectively. You have to learn this as a trait. You can increase the difficulty of the check. Double the difficulty can be used to declare the predefined effects. The check automatically bekomes risky. This allows you to use the same dice to achieve multiple effects. Such a trait costs 1 CP.

*Concentration:*
Some effects have to be kept up. In those cases the successes needed to achieve the effect block the attribute points (dice) from being used for anything else, as long as the concentration lasts. 


This table gives an overview of what is a good difficulty for checks by average CP investment into attribute and skill, and what level of experience such a person would be described as having.
#+ATTR_LATEX: :align c|c|l
| *Dif* | *CP* | *Good for ..* |
|-------+------+---------------|
|     0 |   15 | unskilled     |
|     1 |   25 | beginner      |
|     2 |   30 | experienced   |
|     3 |   35 | master        |
|     4 |   40 | grand master  |
|     5 |   45 | legend        |
For an easy check select the difficulty 1 lower. For a hard check select a difficulty 1 higher.

For a list of effects see the section [[#sec:loeffects][List of Effects]]

