rules.tex
% Created 2023-07-22 Sa 11:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper, total={7in, 11in}]{geometry}
\pagenumbering{gobble}
\usepackage{multicol}
\setlength{\parindent}{0pt}
\setlength{\itemsep}{0.mm}
\usepackage{enumitem}
\setlist[itemize]{noitemsep}
\usepackage[table]{xcolor}
\setcounter{secnumdepth}{3}
\date{}
\title{My Pen And Paper RPG Ruleset}
\hypersetup{
 pdfauthor={Lukas Zumvorde},
 pdftitle={My Pen And Paper RPG Ruleset},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
{\rowcolors{1}{grey!20}{grey!10}


\section{Rules}
\label{sec:orgc622d0e}

\begin{multicols}{2}[]
\subsection{Character Values}
\label{sec:orgf39f851}
\subsubsection{Attributes}
\label{sec:org92211fd}
Attributes dedscribe a characters potential. The higher the value the greater things a character can achieve. There are the following 8 Attributes beloning to the 4 categories.

\begin{center}
\begin{tabular}{lll}
\textbf{Category} & \textbf{Attribute} & \textbf{Description}\\
\hline
Physical & Strength & strength and hardyness\\
 & Dexterity & agility, speed, precision\\
\hline
Mental & Will & percevirance, attention\\
 & Intelect & intellegence, knowledge\\
\hline
Sozial & Empathy & understanding people\\
 & Charisma & interacting with people\\
\hline
Resources & Gear & Gear you have prepared\\
 & Finances & Money and investments\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{c|l}
\textbf{Level} & \textbf{Grade}\\
\hline
3 & Unskilled\\
5 & Beginner\\
7 & Experienced\\
9 & Master\\
11 & Grandmaster\\
13 & Legend\\
\end{tabular}
\end{center}

They determine the amount of dice you can use for \hyperref[sec:org06f1f9d]{checks}. 

\subsubsection{Skill}
\label{sec:org01720e6}
The skill determines the likelyhood of a success on a roll. A roll during a \hyperref[sec:org06f1f9d]{checks} is counted as a success if the dice shows less or equal eyes than the skill.

Skills measure the mastery of a skill. They are expressed as a background description and a level (number between 1 and 6). The skill levels are comparable to how much time a typical person has to spend to reach the same expertise in this area if it were his dayjob. This does however not mean that a character needs to have taken that time to reach his skill level. Level 1 for any skill is free. Not all skills cost the same, the price depends on how specific it is.

\begin{center}
\begin{tabular}{c|l}
\textbf{Level} & \textbf{Equivalent experience}\\
\hline
1 & 0 years\\
2 & 2 years\\
3 & 5 years\\
4 & 10 years\\
5 & 15 years\\
6 & 20 years\\
\end{tabular}
\end{center}

See chapter \hyperref[sec:orgbc18f3a]{List of Skills} for examples.

\textbf{Merge Skills}
It might happen that you have a lot of very specific skills. If that is the case you can combine them to a more general skill. The total CP cost has to stay the same.

\subsubsection{Traits}
\label{sec:org8360d54}
Traits are distinglishing things about the character. They can be bought for character points. This is possible both at character creation and later in the game.
 They might be extraordinary strength or the ability to cast certain magic. Some traits (like all magic) should come with a risk (all checks are risky checks). 

\begin{quote}
Herkulian Stength (7CP):
You are extra strong. For feats of strength you can roll 1 additional die and get at least one success.
\end{quote}

\begin{quote}
Pyromancy (7CP):
You can make a risky mental check to summon the primordial elemental forces of fire. You can shape and direct them to cause effects. 
\end{quote}

\subsubsection{Character Creation}
\label{sec:org52956c8}
Distribute 110 CP on your Attributes, Skills and Traits

Use the Rules under Equipment to limit your starting gear.

Character Advancement:
You may reward your players with CP (character points) for reaching milestones in the story or simply surviving the session.

\begin{itemize}
\item A skill point typicaly costs 7 CP but can vary based on how specific they are.
\item An attribute point costs 2 CP.
\item A Trait typically costs 7 CP but can vary widely. Negative traits can even have a negative price.
\end{itemize}

\subsection{Checks and Contests}
\label{sec:org06f1f9d}
Roll as many six sided dice as your attribute value is. Count each die with your skill level or less eyes and subtract the difficulty (default is 0) of the check. The result are your successes. If the successes are negative the check fails.

\begin{itemize}
\item Parties describe what they indent to do
\item Parties decide (secretly) how many dice they want to use for each action
\item Everybody rolles their dice
\item Results of the checks are described.
\end{itemize}

\textbf{Effects:}
\begin{itemize}
\item Every action has a default effect. For example in a fight it is wounding an enemy.
\item Different effects can also be declared by the player. (e.g. disarming the enemy).
\item Combinations are also possible
\item An Effect might cost more than one success.
\end{itemize}

\textbf{Colaborative checks:}
Everyone rolls individually and then sum together all successes.

\textbf{Contest:}
Both parties each roll their check. the party with the higher successes wins and can use the difference in successes to declare effects. By default the effect is to damage the enemy.

\textbf{Risky checks:}
If a check is risky the character might incurr something bad if the check fails. If the check fails the difference between the negative successes are used to incur effects to the characters disadvantage. 

\textbf{Multible actions:}
You can perform multible actions. The checks are made independently. You can use at most the higher of the atributes numbers of dice in total. For each action your maximum number of dice is your respective attribute value. An common example is to use some of the action to attack and some to defend.

\textbf{Predefined Effekts:}
You can learn to achieve a certain combination of effects very effectively. You have to learn this as a trait. You can increase the difficulty of the check. Double the difficulty can be used to declare the predefined effects. The check automatically bekomes risky. This allows you to use the same dice to achieve multiple effects. Such a trait costs 1 CP.

\textbf{Concentration:}
Some effects have to be kept up. In those cases the successes needed to achieve the effect block the attribute points (dice) from being used for anything else, as long as the concentration lasts. 


This table gives an overview of what is a good difficulty for checks by average CP investment into attribute and skill, and what level of experience such a person would be described as having.
\begin{center}
\begin{tabular}{c|c|l}
\textbf{Dif} & \textbf{CP} & \textbf{Good for ..}\\
\hline
0 & 15 & unskilled\\
1 & 25 & beginner\\
2 & 30 & experienced\\
3 & 35 & master\\
4 & 40 & grand master\\
5 & 45 & legend\\
\end{tabular}
\end{center}
For an easy check select the difficulty 1 lower. For a hard check select a difficulty 1 higher.

For a list of effects see the section \hyperref[sec:orgcbc704c]{List of Effects}
