rules.tex

\subsection{Damage}
\label{sec:org40ba4fa}
Damage reduces the attribute points (points) you can use. Damage is typically taken on attribute categories. If this is the case the victim can divide the damage aritrarily on the attributes in the category. Once your attribute effectively falls below 0 you are out of commision with regards to this attribute. The way in which you are taken out depends on the attribute and what caused the damage.

\begin{quote}
Bob the Barbarian got hit in combat multiple times. He has 4 Physical but 3 physical wounds. Now he additionally got confused by a spell and thinks his Comrades are enemys. His compatriot Roger the Rogue tries to nonlethaly take him out by hitting him with his blackjack over the head. He succeeds and makes another 2 damage. Bob goes down, bleeding from his old wounds but still alive.
\end{quote}

\begin{quote}
Silvia the Spy finds herself in a fierce debate with the Diplomat. She trys to convince him to go with her plan. Over the time she makes 3 social damage which is enough to convince him, as his social position is severely damaged by the documents she leaked a week ago.
\end{quote}

Depending on the source of the damage it might heal after each scene, mission or kampagnie.
\begin{itemize}
\item Scene: A thematically connected timeframe like a fight. (example: unarmed, blackjack, nets, drowning)
\item Mission: Until a milestone in the game is reached, for example until the quest is finished or story beat is reached (example; sword, fire, knive, falling great heights)
\item Kampagnie: Until a longterm goal is reached. For example until the evil King is vanquished. (example: nasgul blade, daemonic poison)
\end{itemize}
The short form to write this is 2s(/m/k) for two damage that heals by the end of the scene(/mission/kampagnie).

\subsection{Armor / Damage reduction}
\label{sec:orgdcb5603}
Armor or damage reduction (DR) does not negate damage completely but it changes its type to one that is faster to heal. With an armor of 2 up to 2m damage per contest are bein reduced to 2s damage. Normally damage reduction should only go down to scene level and not remove damage completely. As an optional rule however you can decide that scene damage can be reduced to nothing as long as at least 1 dmg stays. When considering armor always think about the complete set being worn and not about simgle pieces. Decide which armor class fits.

\begin{center}
\begin{tabular}{l|c}
\textbf{Armor Class} & \textbf{DR}\\
\hline
none & 0\\
light & 1\\
medium & 2\\
heavy & 3\\
\end{tabular}
\end{center}

\subsection{Range}
\label{sec:orgd6a2e9a}
There are 3 different ranges. It takes one round and half your dice for this round to move one range class. You can however move within a range class unrestricted (within reason). While moving you can still use your action.

Close: Normal close quarters fighting distance.
Near: A distance you can throw something at.
Far: Quite a distance away. You might be able to shoot a rifle or a bow at this distance but it takes a while to run this distance.

\subsection{Items and Equipment}
\label{sec:org8492c64}

Items have a RV (Ressource Value) this determines how expensive or hard to get it is. Apart from that they have a description and maybe special effects. Let your fantasy go wild. A few examples can be found below.

An item can be found or bought. To buy an item you need to be somewhere where it is possible to be bought. Roll on Ressources. If you get at least the RV successes you have bought the item.

\begin{quote}
Sword (RV 2):
Its a stabby piece of metal. Especially good at harming unarmored enemies. Not so great at slicing though armor. 
\end{quote}

\begin{quote}
Chainmail (RV 3):
A metal fabric that protects your torso and arms from being cut or stabbed pretty well. 
\end{quote}

To create an item first give it a short description. It should make clear on what what kind of actions it may give advantages or what kind of effects may be created with it. Second you determine its RV (ressource value).

\begin{center}
\begin{tabular}{c|l|l}
\textbf{RV} & \textbf{Description} & \textbf{Example}\\
\hline
0 & Free & a club\\
1 & Cheap & simple clothes, basic tools\\
2 & Affordable & regular car, appartment\\
3 & Costly & regular house\\
4 & Expensive & sportscar\\
5 & Very Expensive & small airplane\\
6 & Luxourious & private jet\\
\end{tabular}
\end{center}


\subsubsection{Equipment}
\label{sec:org71a3b74}
Characters can have gear with a value of up to the attribute resources / 2 in RV on them. They must be able to carry all that gear on them or if it is part of their household it must fit in their normaly furnished home. Apply reason as necessary.

When out adventuring characters have all the gear that they have written down. Additionally they can be allowed to make a resources check against the RV of what they would like to have in the moment to see if they do. The check is risky and if they fail they get the difference in damage to their resources attribute until the end of the mission.

\subsubsection{Buying}
\label{sec:orgb073b67}
Characters can buy new stuff with a finances check against the RV of what they want to buy. The check is risky and they get the difference in damage on their finances until the end of the mission if they fail. The GM does not have to let you retry on a fail.

\subsubsection{Crafting}
\label{sec:orge836916}
Characters can also build their own items. For that they need the appropriate tools and resources. The resources may be bought for the RV-1 of the item to be build. To build the item the character needs to make a check with RV difficulty. If that fails the resoruces might be lost, depending on what they are.

\subsubsection{Gathering}
\label{sec:orgf3c51d9}
Resources can be gathered with a check and their RV as difficulty.

\subsubsection{Bribing}
\label{sec:orgbc14048}
To Bribe someone you need to give them more than they can normally compfortably afford. This means you need more than half their finances value in successes to bribe them.

\newpage
