rules.tex
\section{Lists}
\label{sec:org9826e1a}

\subsection{List of Traits}
\label{sec:orgdba58df}
The list is not exaustive. It should only be taken as a list of examples.

\begin{quote}
\textbf{Friend of Nature} (7): You can talk to the forces of nature and have a chance to convince them to help you. This can be asking, a bird what he has seen, letting youself be concealed by a bush or calling a wild bear to aid you in combat.
\end{quote}

\begin{quote}
\textbf{Illusionist} (7): You are adapt at creating illusions. The bigger and more complex they get the harder this is.
\end{quote}

\begin{quote}
\textbf{Speedster} (14): You have incredible speed. Others see only a blur when you sprint past them. This often gives you an advantage on dexterity checks and you always have at least 1 success in them.
\end{quote}

\begin{quote}
\textbf{Medium} (7): You can commune with ghosts and spirits. You have no control over them, but you can gain their attention.
\end{quote}

\begin{quote}
\textbf{Nightvision} (7): You can see in darkness as if it were light.
\end{quote}

\begin{quote}
\textbf{Sleepless} (7): You dont need sleep. This means you have a lot more time in a day, but you still need to rest from to much physical or mental excertion.
\end{quote}

\begin{quote}
\textbf{Flight} (16): You can fly. Be it with wings or otherwise. Your speed in flight is no different from your speed on land.
\end{quote}

\begin{quote}
\textbf{Tinkerer} (7): You can build wonderous mechanikal marvels. From clocks up to steam powered automata. 
\end{quote}

\begin{quote}
\textbf{Hacker} (7): You are not only proficient in computer science but you can even achieve movie worthy feats like stoping another car with only your laptop during a car chase. Tools not included.
\end{quote}

\begin{quote}
\textbf{Plot Armor} (1): Each scene you can discard a point of damage you would take. The plot armor only allies to one of the categories (Physical, Mental, Sozial) This trait can be taken multiple times.
\end{quote}


\subsection{List of Skills}
\label{sec:orgbc18f3a}
The list is not exaustive. It should only be taken as a list of examples. The CP costs are per level.

\begin{quote}
\textbf{Professional Chef} (7 CP): You have learned not only to cook but also to plan the foodstuffs on storage, to store propperly, to calucalte profitability, to motivate and coordinate a team of people.
\end{quote}

\begin{quote}
\textbf{Soldier} (7 CP): You have learned to bear harsh weather, climb over obstacles, run, dodge and shoot. You have learned dicipline and coordination.
\end{quote}

\begin{quote}
\textbf{Trouthsayer} (7 CP): You have learned to peer into possible futures, read people and make inferences on what will likely happen. You have learned the art of putting on an act. 
\end{quote}

\begin{quote}
\textbf{Ranger} (7 CP): You know how to survive in the wild. You can hunt, bushcraft and gather everything you need. You have honed your hearing and are proficient at tracking.
\end{quote}

\begin{quote}
\textbf{College Mage} (7 CP): You have studied the art of magic. You learned them with books, astronomy and experiments. You can cast spells by pronouncing incantations, magical glyphs and potent periphinalia. You still need the appropriate trait to cast magic from specific schools of magic.
\end{quote}

\begin{quote}
\textbf{Survivalist} (1 CP): You have spend quite a lot of time outdoors. Consumed books about wilderness survival and so on. You know how to build shelter, find food and water, and much more. 
\end{quote}


\subsection{List of Items}
\label{sec:org886eea3}
The list is not exaustive. It should only be taken as a list of examples.

\begin{quote}
\textbf{Club of the great Bear} (RV 4): A mystical club made from the thigh bone of the great bear that terrorized the inokwa people. It still contains the strength of the mighty beast. When using this club you gain 1 additional skill level in strength checks.
\end{quote}

\begin{quote}
\textbf{Knightly Armor} (RV 4): A good example of heavy armor that protects from physical damage from most weapons.
\end{quote}

\begin{quote}
\textbf{Protective Amulet} (RV 2): This amulet made from magicaly potent elderwood protects lightly (1 damage reduction) from mental damge comming from magic.
\end{quote}

\begin{quote}
\textbf{Pentagram Amulet} (RV 2): This amulet was made to prevent possession and influence of otherworldly forces. Allows you to rerol 1 die against attacks against your mental state when comming from ghosts, magic, or similar forces.
\end{quote}

\begin{quote}
\textbf{Potion of Healing} (RV 3): When being drunk it allows you to reduce the healing time of up to 4 physical damage from M to S
\end{quote}

\begin{quote}
\textbf{Shield} (RV 2): Gives the reroll of 1 die when blocking with the shield.
\end{quote}

\begin{quote}
\textbf{Sword} (RV 2): This stabby piece of steel typically makes class M damage. Its also good at slicing.
\end{quote}
