rules.org
** List of Effects
:PROPERTIES:
:CUSTOM_ID: sec:loeffects
:END:

#+begin_quote
*Damage:* Each success is used to cause 2 damage to an enemy.
#+end_quote

#+begin_quote
*Block:* Each success is used to remove one success from an enemies attack on you or one of your collegues. If you win a contest with a block you can deal 1 damage per success (type appropriate to the weapon used). If an enemies block would deal damage to you it can also be blocked.
#+end_quote

#+begin_quote
*Disarm:* For 2 successes disarm one enemy.
#+end_quote

#+begin_quote
*Push:* For 1 success you can force your enemy to move slightly. Pushing an ememy off a cliff still gives them a check to prevent them from falling.
#+end_quote

#+begin_quote
*Disable:* You can force an enemy into an unfavorable position. For each 2 successes the enemy is denied to use one level of his applicable skill. The enemy can recover from this with a check. The DM decides if this recovery can be blocked. Example: Putting the enemy into an ankle lock.
#+end_quote

#+begin_quote
*Gain Advantage:* For 1 success each you can make your position more advantageous. This allows you to reroll 1 die on applicable checks until the end of the scene. Examples: Gaining the high ground, flanking the enemy.
#+end_quote

#+begin_quote
*Cause Disadvantage:* For 1 success each you can make the enemys position more disadvantageous. This means he has to rerol 1 die that would otherwise be a success until the end of the scene. Example: Forcing the emeny into a tight corner. 
#+end_quote

#+begin_quote
*Blind:* For 2 successes. Take an emenys sense. Examples: Throw sand into eyes, Shatter eardrums with a lound noise.
#+end_quote

#+begin_quote
*Summon:* Per success the summoned being has 10 CP. The summon holds until the end of the scene or until the end of the concentration.
#+end_quote

#+begin_quote
*Obfuscate Area:* Per 4 successes you can obfuscate an area with regards to one sense. For example by causing total darkness or stopping all sound. The effect holds until the end of the scene or until the end of the concentration.
#+end_quote

#+begin_quote
*Purify Thing:* Per success you can purify one unit of a non sentient thing. For example remove poisons from one days worth of food, or remove the daemonic blight from a couple trees in the forrest.
#+end_quote

#+begin_quote
*Amplify Aspect:* Per 2 successes you increase an inherent aspect of a thing by 1 level. An example is increasing the protection of an armor by 1 or increasing the weight of a stone.
#+end_quote

#+begin_quote
*Buff:* For 1 success increase an attribute by 1. The effect holds until the end of the scene or until the end of the concentration.
#+end_quote

#+begin_quote
*Shapeshift:* Take the form of another being. The new forms max CP depends on the sucesses. Per success get 15 CP (max is the characters total CP). The effect holds until the end of the scene or until the end of the concentration.
#+end_quote

#+begin_quote
*Illusion:*
#+end_quote

#+begin_quote
*Deceive:* 
#+end_quote

#+begin_quote
*Influence:* 
#+end_quote

#+begin_quote
*Shape Reality:* 
#+end_quote

#+begin_quote
*Move:* Be it teleportation or a magic portal. 
#+end_quote

#+begin_quote
*Heal:* Per success turn 1m damage to 1s damage.
#+end_quote

#+begin_quote
*Counter/Break:* Counter or break a spell or technique.
#+end_quote

#+begin_quote
*Insight:* 
#+end_quote

#+begin_quote
*Stop:* 
#+end_quote

#+begin_quote
*:* 
#+end_quote

#+begin_quote
*:* 
#+end_quote


** List of NPCs
:PROPERTIES:
:CUSTOM_ID: sec:lonpcs
:END:

#+begin_quote
*Goblin* (34 CP)
P:2, M:1, S:1, R:1, Bandit 2, Nightvision
#+end_quote

#+begin_quote
*Wolf* (38 CP)
P:3, M:1, S:2, R:0, Packhunter 3
#+end_quote

#+begin_quote
*Guard* (76 CP)
P:4, M:4, S:4, R:4, Cityguard 3
#+end_quote

#+begin_quote
*Dark Mage* (125 CP)
P:3, M:8, S:4, R:6, Necromancer 3, Telepathic Link to undead servants
#+end_quote

#+begin_quote
*Ogre* (90 CP)
S:16, D:8, W:6, I:2, E:2 ,C:2, G:1, F:1, Ogre Stuff: 3
#+end_quote

#+begin_quote
*Zombie* (31 CP)
P:3, M:1, S:1, R:1, Infectious Bite
#+end_quote

#+LATEX: \newpage
* Optional Rules

** Less precise Attributes
Instead of using the Attributes as listed you can use only the Categories. Learning a level in one of the categories costs duble of what a level in an attribute would cost.

** No Abstraction for Money
To remove the resources category from the attributes just raise the price of learning a level of the other attributes by 33%. The costs for goods and services depend on the kampaign setting.

** Fixed spells with optional free casting of magic
If you want spells in general to be predefined but still allow for free casting from time to time you can use the fixed spells optional rules and add the following. When free casting magic you dont need to have the trait for the spell and can even create the spell on the fly, but all effects cost double the successes on a roll. All magic checks stay risky.

** Fixed spells
If you dont want PCs to be able to create situation specific spells then you can disallow it. Instead you need to define for every spell what effects they cause. Look at the rules for contests for guidance. The difficulty of the spell should be the ammount of successes you would have needed to cause those effects. To learn a spell the player has to aquire it as a trait. Such a trait can be comparatively cheap though (1-5 CP depending on how many spells you want to exist). All spell checks are risky checks.

** Retroactive Actions
The DM may allow players retroactively having performed some action. For example having placed a trap beforehand. To balance this any check on such an action should be a risky check.

** Too Many Dice
It can happen that you have to roll to many dice at once. If that happens your can instead divide the number of dice by a number (2,3,4) and multiply the number of successes by that number. If the dice are not evenly divisible just roll the rest regularly. It is advisable to use this method if the number of dice exeeds 12.

** Exhausting Combat
To limit the duration of a combat scene apply this rule. If in one round no party takes any damage, then apply 1s damage to each combatant. 

#+LATEX: \end{multicols}

* COMMENT Playtest questions
Should you be able to move and act in a single round?

For initative should all move at once or should we use group initiative?

Does the money and item system feel good?
